In [ ]:
================== Data Analysis ====================
1.  Pandas               : Data frame analysis
2.  Numpy                : Numerical analysis
3.  Matplotlib           : Graphs and plots
4.  Seaborn              : Plots
5.  Bokeh                : Plots
6.  Plotly               : Plots

================== Machine Learning =================

7.  Stats                : Statistical models
8.  Scikit-learn         : ML models

================== Deep Learning ====================
    
9.  OpenCV               : Computer vision
10. Pillow               : Image operations
11. TensorFlow           : Neural network creation (Google)
12. Keras                : Neural networks
13. PyTorch              : Alternative to TensorFlow (Meta/Facebook)

====================== NLP ==========================

14. NLTK                 : Natural language toolkit
15. SpaCy                : Alternative to NLTK
16. WordCloud            : Most frequent words

==================== Scraping =======================
    
17. SQLite               : Database creation
18. Beautiful Soup       : Web scraping
19. Selenium             : Web automation

================== API Creation =====================
    
20. Flask                : Web framework
21. FastAPI              : Web framework
22. Gradio               : API/UI creation
23. Django               : Web framework

================== UI App Creation ==================

24. Streamlit            : UI/Apps for ML/DL

========== Transfer Learning Models (DL) ============

25. MobileNet            : CNN model
26. ResNet               : CNN model
27. VGGNet               : CNN model
28. Inception            : CNN model
29. YOLO                 : Object detection (Ultralytics)

========== Transfer Learning Models (NLP) ===========

30. Word2Vec             : Word embeddings
31. GloVe                : Word embeddings

=============== Hugging Face Transformers ===========

32. BERT                 : Bi-directional Encoder Representations

==================== Allen NLP ======================
    
33. AllenNLP             : NLP research library

====================== GenAI ========================

34. LangChain            : LLM orchestration
35. Google Gemini        : Google’s GenAI models
36. OpenAI GPT           : OpenAI’s LLMs
37. Amazon Bedrock       : AWS GenAI platform
38. Meta LLaMA           : Meta’s LLM family
==================== Image and Video Generations ====================

39. GAN models realted packages
40. SORA related packages
==================== Model deployment (MLOps) ====================
    
41. mlflow using databricks
42. kubeflow (GCP account)

==================== Cloud applications ====================

43. Azure ML realted packages
44. GCP VertexAI related packages
45. AWS Sagemaker realted packages

==================== small ====================
46. time
47. logging
48. math
49. random
50. env
51. os

**Step-1: Import packages**

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2: Create a Dataframe using list**

- data  : your data either list or dict

- index  : We need to provide a list

- columns: We need to provide a list

In [4]:
name=['Amit','Anant','Subrat']
pd.DataFrame(name,columns=['Names'])

#pd.DataFrame (data,index,column)

    Names
0    Amit
1   Anant
2  Subrat

**Step-3: Change the index**

In [5]:
name=['Amit','Anant','Subrat']
pd.DataFrame(name,
             index=['A','B','C'],
             columns=['Names'])

    Names
A    Amit
B   Anant
C  Subrat

In [6]:
name=['Amit','Anant','Subrat']
idx=['A','B','C']
cols=['Names']
pd.DataFrame(name,
             index=idx,
             columns=cols)

    Names
A    Amit
B   Anant
C  Subrat

**Step-4: Add multiple columns**

In [7]:
name=['Amit','Anant','Subrat']
age=[20,22,24]
idx=['A','B','C']
pd.DataFrame(zip(name,age),
             index=idx,
             columns=['Names','Age'])

    Names  Age
A    Amit   20
B   Anant   22
C  Subrat   24

**Step-5: Create empty data and update the column**

In [8]:
df=pd.DataFrame()
df['Names']=['Amit','Anant','Subrat']
df['age']=[20,22,24]
df

    Names  age
0    Amit   20
1   Anant   22
2  Subrat   24

**Step-6: Add a new column with existing dataframe**

In [9]:
name=['Amit','Anant','Subrat']
age=[20,22,24]
df=pd.DataFrame(zip(name,age),
             columns=['Names','Age'])
df['City']=['Hyd','Pune','Blr']
df

    Names  Age  City
0    Amit   20   Hyd
1   Anant   22  Pune
2  Subrat   24   Blr

**Step-7: Overwrite the column values**

- i want to overwrite my age
- ordinally

In [10]:
df['age']=[30,32,34]
df['Age']=[30,32,34]
df

    Names  Age  City  age
0    Amit   30   Hyd   30
1   Anant   32  Pune   32
2  Subrat   34   Blr   34

**Step-8: Drop the column**

- labels
- axis
- index
- columns
- inplace

In [11]:
df

    Names  Age  City  age
0    Amit   30   Hyd   30
1   Anant   32  Pune   32
2  Subrat   34   Blr   34

In [12]:
df.drop('age')

KeyError: "['age'] not found in axis"

In [ ]:
df.drop('age',axis=0) # error
df.drop('age')

In [ ]:
df.drop('age',
        axis=1)

In [ ]:
df   # we are able to see old column 
#because we did not apply inplace= True

In [ ]:
df.drop(columns=['age'])

In [ ]:
df

In [ ]:
# whenever 

df.drop(columns=['age'],inplace=True)

In [ ]:
df

In [ ]:
#drop index =2
df.drop(2,
       axis=0)

In [13]:
df.drop(index=2)

   Names  Age  City  age
0   Amit   30   Hyd   30
1  Anant   32  Pune   32

**Step-9: Rename the column**

In [14]:
mapper: dictionary
index:
columns:
axis:
copy:
inplace:

SyntaxError: invalid syntax (2046463599.py, line 2)

In [15]:
df

    Names  Age  City  age
0    Amit   30   Hyd   30
1   Anant   32  Pune   32
2  Subrat   34   Blr   34

In [16]:
dict1={'City':'city'}
df.rename(dict1)

    Names  Age  City  age
0    Amit   30   Hyd   30
1   Anant   32  Pune   32
2  Subrat   34   Blr   34

In [17]:
dict1={'City':'city'}
df.rename(columns=dict1)

    Names  Age  city  age
0    Amit   30   Hyd   30
1   Anant   32  Pune   32
2  Subrat   34   Blr   34

In [18]:
df

    Names  Age  City  age
0    Amit   30   Hyd   30
1   Anant   32  Pune   32
2  Subrat   34   Blr   34

In [19]:
dict1={'City':'city'}
df.rename(columns=dict1,
         inplace=True)
df

    Names  Age  city  age
0    Amit   30   Hyd   30
1   Anant   32  Pune   32
2  Subrat   34   Blr   34

In [20]:
idx={2:'B'}
df.rename(index=idx,inplace=2)
df

    Names  Age  city  age
0    Amit   30   Hyd   30
1   Anant   32  Pune   32
B  Subrat   34   Blr   34

In [21]:
df1=pd.DataFrame()
df1['value']=[i for i in range(1,10)]
df1['square_value']=[i**2 for i in range(1,10)]
df1['cube_value']=[i**3 for i in range(1,10)]
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

- len
- columns
- shape
- dtypes
- head
- tail

In [22]:
df1.columns

Index(['value', 'square_value', 'cube_value'], dtype='object')

In [23]:
list(df1.columns)

['value', 'square_value', 'cube_value']

In [24]:
df1.columns.to_list()

['value', 'square_value', 'cube_value']

In [25]:
df1.shape

(9, 3)

In [26]:
df1.dtypes
# integer we get int
# float we get float
# string we get object

value           int64
square_value    int64
cube_value      int64
dtype: object

In [27]:
df1.head(2)

   value  square_value  cube_value
0      1             1           1
1      2             4           8

In [28]:
df1.tail()

   value  square_value  cube_value
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [29]:
df1.tail(2)

   value  square_value  cube_value
7      8            64         512
8      9            81         729

In [30]:
len(df1)

9

In [31]:
df1.isnull()
#we are asking qn
# a null value available or not
# True or false
# True means null value available
# False means not Null value not available

   value  square_value  cube_value
0  False         False       False
1  False         False       False
2  False         False       False
3  False         False       False
4  False         False       False
5  False         False       False
6  False         False       False
7  False         False       False
8  False         False       False

In [32]:
df1.isnull().sum()
# column wise will null value count will display

value           0
square_value    0
cube_value      0
dtype: int64

In [33]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   value         9 non-null      int64
 1   square_value  9 non-null      int64
 2   cube_value    9 non-null      int64
dtypes: int64(3)
memory usage: 348.0 bytes

**Step-10:**
- How to change a specific value of a column
- df1.drop
    - either it will drop column or index
- df1.rename
    - either it will rename column or index
- df1.replace
    - it replace the value

In [34]:
# replace cube_value 64 to 464 
df1.replace(64,464)
df1.replace({64:464,1:111})   # all the data will replace

   value  square_value  cube_value
0    111           111         111
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8           464         512
8      9            81         729

**Step-11: Selection of a column**

In [35]:
df1['cube_value']
# series
# series look like data frame
# row and column

0      1
1      8
2     27
3     64
4    125
5    216
6    343
7    512
8    729
Name: cube_value, dtype: int64

In [36]:
type(df1)

pandas.core.frame.DataFrame

In [37]:
type(df1['cube_value'])

pandas.core.series.Series

In [38]:
df1.shape   # 2 Dimensional

(9, 3)

In [39]:
df1['cube_value'].shape

(9,)

In [40]:
df1[['cube_value']]

   cube_value
0           1
1           8
2          27
3          64
4         125
5         216
6         343
7         512
8         729

In [41]:
df1[['cube_value']].shape

(9, 1)

In [42]:
# square_value
# cube_value
# multiple always keep those in list
df1['cube_value','square_value']

KeyError: ('cube_value', 'square_value')

In [43]:
df1[['cube_value','square_value']]

   cube_value  square_value
0           1             1
1           8             4
2          27             9
3          64            16
4         125            25
5         216            36
6         343            49
7         512            64
8         729            81

In [44]:
df1['cube_value'].replace(64,643,inplace=True)

In [45]:
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         643
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

**Step-12: How to append a row**
- loc
- iloc

In [47]:
# df1.loc[rows,columns]
# we can select particular rows and columns using a list :[start:stop:step]

df1.loc[3:7]

   value  square_value  cube_value
3      4            16         643
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512

In [48]:
df1.iloc[3:7,1:3]

   square_value  cube_value
3            16         643
4            25         125
5            36         216
6            49         343

In [49]:
df1.loc[3:7,['square_value','cube_value']]  # numbers is not allow in loc

   square_value  cube_value
3            16         643
4            25         125
5            36         216
6            49         343
7            64         512

In [50]:
cols=['square_value','cube_value']
df1.loc[3:7,cols]

   square_value  cube_value
3            16         643
4            25         125
5            36         216
6            49         343
7            64         512

In [51]:
df1.iloc[[2,3,4]]  
# select 3 row and all column 
# dataframe

   value  square_value  cube_value
2      3             9          27
3      4            16         643
4      5            25         125

In [52]:
df1.iloc[[2]]
# 2D Dataframe

   value  square_value  cube_value
2      3             9          27

In [53]:
df1.iloc[2]
# 1D series

value            3
square_value     9
cube_value      27
Name: 2, dtype: int64

In [61]:
df1.iloc[[2,3,4],[0,2]]
# 2,3,4 row
# 0 and 2nd index

   value  cube_value
2      3          27
3      4         643
4      5         125

In [55]:
df1.iloc[2,0]
# 1D

np.int64(3)

In [62]:
df1
#

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         643
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [56]:
df1.iloc[:,0]
# all row and first column

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: value, dtype: int64

In [57]:
df1.iloc[2,:]

value            3
square_value     9
cube_value      27
Name: 2, dtype: int64

In [58]:
df1.iloc[[2],:]

   value  square_value  cube_value
2      3             9          27

In [59]:
df1.iloc[2:6,0]

2    3
3    4
4    5
5    6
Name: value, dtype: int64

In [60]:
df1.iloc[2:6,[0]]

   value
2      3
3      4
4      5
5      6

**Step-13:How to append a row**

In [63]:
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         643
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [64]:
df1.loc[9]=[10,100,1000]
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16         643
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729
9     10           100        1000

In [65]:
len(df1)

10

In [67]:
ID=len(df1)
df1.loc[ID]=[11,121,1331]
df1

    value  square_value  cube_value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16         643
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     11           121       12321
11     11           121        1331

**Step-13: Save the dataframe**

- we can save dataframe in two ways

- .csv

- .xlsx

- where I want to save : Directory

- what the file name to save : file name

- what is the type of a file : extension

- Different folder : r"C:\Users\subra\OneDrive\Documents\Datafile\data1.csv"

- Different folder : r"C:\Users\subra\OneDrive\Documents\Datafile\data1.xlsx"

- same folder: r"data1.csv" or r"data1.xlsx"

In [71]:
csv_path=r"C:\Users\subra\OneDrive\Documents\Datafile\data1.csv"
excel_path=r"C:\Users\subra\OneDrive\Documents\Datafile\data1.xlsx"
df1.to_csv(csv_path)
df1.to_excel(excel_path)

In [72]:
csv_path=r"data1.csv"
excel_path=r"data1.xlsx"
df1.to_csv(csv_path)
df1.to_excel(excel_path)

**Step-14: Read the data**

In [75]:
csv_path=r"data1.csv"
pd.read_csv(csv_path)

    Unnamed: 0  value  square_value  cube_value
0            0      1             1           1
1            1      2             4           8
2            2      3             9          27
3            3      4            16         643
4            4      5            25         125
5            5      6            36         216
6            6      7            49         343
7            7      8            64         512
8            8      9            81         729
9            9     10           100        1000
10          10     11           121       12321
11          11     11           121        1331

In [76]:
excel_path=r"data1.xlsx"
pd.read_excel(excel_path)

    Unnamed: 0  value  square_value  cube_value
0            0      1             1           1
1            1      2             4           8
2            2      3             9          27
3            3      4            16         643
4            4      5            25         125
5            5      6            36         216
6            6      7            49         343
7            7      8            64         512
8            8      9            81         729
9            9     10           100        1000
10          10     11           121       12321
11          11     11           121        1331

In [77]:
csv_path=r"data1.csv"
excel_path=r"data1.xlsx"
df1.to_csv(csv_path,index=False)   # index column created
df1.to_excel(excel_path,index=False) #

In [78]:
csv_path=r"data1.csv"
pd.read_csv(csv_path)

    value  square_value  cube_value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16         643
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     11           121       12321
11     11           121        1331

In [79]:
excel_path=r"data1.xlsx"
pd.read_excel(excel_path)

    value  square_value  cube_value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16         643
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     11           121       12321
11     11           121        1331